<a href="https://colab.research.google.com/github/mukmookk/Born2beroot/blob/main/Week1_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

주피터 SQL 엔진 설정

In [3]:
%load_ext sql

In [2]:
!pip install SQLAlchemy==1.4.47

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting SQLAlchemy==1.4.47
  Downloading SQLAlchemy-1.4.47-cp310-cp310-manylinux_2_5_x86_64.manylinux1_x86_64.manylinux_2_17_x86_64.manylinux2014_x86_64.whl (1.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 42.3 MB/s eta 0:00:00
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from SQLAlchemy==1.4.47) (2.0.2)
Installing collected packages: SQLAlchemy
  Attempting uninstall: SQLAlchemy
    Found existing installation: SQLAlchemy 2.0.10
    Uninstalling SQLAlchemy-2.0.10:
      Successfully uninstalled SQLAlchemy-2.0.10
Successfully installed SQLAlchemy-1.4.47

In [4]:
# ID와 PW를 자신의 환경에 맞게 수정
%sql postgresql://guest:Guest1!*@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev

다양한 SELECT 실행해보기

In [5]:
%%sql SELECT *
FROM raw_data.user_session_channel
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(1651, '0004289ee1c7b8b08c77e19878106ae3', 'Organic'),
 (1197, '00053f5e11d1fe4e49a221165b39abc9', 'Facebook'),
 (1401, '00056c20eb5a029583db75506953f1d9', 'Facebook'),
 (1399, '00063cb5da1826febf178b669eea3250', 'Facebook'),
 (1667, '000958fdaefe0dd06f5d7c4e4a5f28d1', 'Instagram'),
 (468, '000a3f777828d2cdbee98887561aa130', 'Facebook'),
 (1563, '000cb7efa8a05429dd5309b4bea2eb0c', 'Naver'),
 (711, '00106ac9184e7d54b570d0f0cb0c38b2', 'Organic'),
 (473, '0011df6282fe8cf78feeab676fbc3c27', 'Naver'),
 (420, '00126b47d5502dfb7d01f750ad23d813', 'Facebook')]

In [6]:
%%sql

SELECT COUNT(1)
FROM raw_data.session_timestamp;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(101520,)]

In [7]:
%%sql

SELECT *
FROM raw_data.session_timestamp
LIMIT 1

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[('00029153d12ae1c9abe59c17ff2e0895', datetime.datetime(2019, 10, 18, 14, 14, 5, 100000))]

In [8]:
%%sql

SELECT DATE(ts) yearmonthday, sessionID
FROM raw_data.session_timestamp
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 10, 18), '00029153d12ae1c9abe59c17ff2e0895'),
 (datetime.date(2019, 11, 16), '0004289ee1c7b8b08c77e19878106ae3'),
 (datetime.date(2019, 8, 10), '0006246bee639c7a7b11a08e34dd3cc6'),
 (datetime.date(2019, 7, 6), '0006dd05ea1e999ddaa041a7091b7b36'),
 (datetime.date(2019, 11, 2), '000958fdaefe0dd06f5d7c4e4a5f28d1'),
 (datetime.date(2019, 11, 29), '000a3f777828d2cdbee98887561aa130'),
 (datetime.date(2019, 7, 17), '000a91f3e374e6147d58ed1814247508'),
 (datetime.date(2019, 7, 23), '000cb7efa8a05429dd5309b4bea2eb0c'),
 (datetime.date(2019, 8, 21), '000d0c74074191add6f22e0004db8f76'),
 (datetime.date(2019, 9, 21), '000d54aadcedee0739d39127955f2cdb')]

In [9]:
%%sql

SELECT DATE(ts) date, sessionID
FROM raw_data.session_timestamp
ORDER BY ts desc
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 11, 30), '6309ff4befccf8ba77b16141fab763c6'),
 (datetime.date(2019, 11, 30), '42daed3b750cc5c6270636fddee0486d'),
 (datetime.date(2019, 11, 30), '398c674511e98d3e9bd40ba5bfa67af8'),
 (datetime.date(2019, 11, 30), '1e65c9f788d6382abc0ee60886e7fa4a'),
 (datetime.date(2019, 11, 30), 'ec6d363a01a8a0691d24b8556bc1fb61'),
 (datetime.date(2019, 11, 30), '8f48bd8292fc4540404dc9dae06175e6'),
 (datetime.date(2019, 11, 30), '89a76004709bb668a8aefb6306a6aed1'),
 (datetime.date(2019, 11, 30), '9cfaefd1e81f637fad6330ff16eb1f39'),
 (datetime.date(2019, 11, 30), 'bbf2f1c020c5e39734c73223784bd7b4'),
 (datetime.date(2019, 11, 30), 'bac82af401b714e895c9c46af11f76ea')]

In [10]:
%%sql

SELECT DATE(ts) date, COUNT(sessionID) -- COUNT(1)
FROM raw_data.session_timestamp
GROUP BY 1 
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 9, 26), 561),
 (datetime.date(2019, 10, 16), 627),
 (datetime.date(2019, 5, 22), 251),
 (datetime.date(2019, 8, 13), 603),
 (datetime.date(2019, 11, 2), 556),
 (datetime.date(2019, 6, 15), 343),
 (datetime.date(2019, 10, 26), 571),
 (datetime.date(2019, 9, 20), 536),
 (datetime.date(2019, 10, 12), 619),
 (datetime.date(2019, 8, 5), 561)]

In [11]:
%%sql

SELECT DATE(ts) date, COUNT(sessionID)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

10 rows affected.

[(datetime.date(2019, 10, 23), 678),
 (datetime.date(2019, 11, 13), 671),
 (datetime.date(2019, 11, 12), 668),
 (datetime.date(2019, 10, 11), 665),
 (datetime.date(2019, 10, 29), 660),
 (datetime.date(2019, 10, 21), 653),
 (datetime.date(2019, 11, 5), 652),
 (datetime.date(2019, 11, 11), 651),
 (datetime.date(2019, 10, 14), 648),
 (datetime.date(2019, 11, 7), 645)]

In [12]:
%%sql

SELECT DATE(ts) date, COUNT(sessionID)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 1
LIMIT 10; -- DESC

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 5), 144),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 9), 169),
 (datetime.date(2019, 5, 10), 176)]

JOIN에 대해 배워보자. 일별 방문 유니크한 사용자의 수를 계산하고 싶다면?

In [13]:
# raw_data.user_session_channel과 raw_data.session_timestamp 테이블의 조인이 필요
%%sql

SELECT DATE(st.ts) date, COUNT(usc.userID) -- 세션수 카운트와 동일. COUNT(NULL): 0, 그 이외의 모든 경우는 1을 리턴
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 5), 144),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 9), 169),
 (datetime.date(2019, 5, 10), 176)]

In [17]:
# raw_data.user_session_channel과 raw_data.session_timestamp 테이블의 조인이 필요
%%sql

SELECT DATE(st.ts) date, COUNT(DISTINCT usc.userID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 10, 21), 549),
 (datetime.date(2019, 10, 14), 541),
 (datetime.date(2019, 10, 11), 539),
 (datetime.date(2019, 10, 23), 535),
 (datetime.date(2019, 10, 29), 535),
 (datetime.date(2019, 10, 10), 533),
 (datetime.date(2019, 10, 8), 532),
 (datetime.date(2019, 10, 22), 529),
 (datetime.date(2019, 10, 18), 528),
 (datetime.date(2019, 10, 9), 526)]

In [18]:
%%sql

SELECT channel, count(st.sessionID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
6 rows affected.

[('Facebook', 16791),
 ('Google', 16982),
 ('Instagram', 16831),
 ('Naver', 16921),
 ('Organic', 16904),
 ('Youtube', 17091)]

In [20]:
%%sql

SELECT channel, count(DISTINCT usc.userId)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
6 rows affected.

[('Facebook', 16791),
 ('Google', 16982),
 ('Instagram', 16831),
 ('Naver', 16921),
 ('Organic', 16904),
 ('Youtube', 17091)]

In [26]:
%%sql

SELECT DISTINCT channel
FROM raw_data.user_session_channel 
WHERE channel ilike '%o%'
LIMIT 5

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
4 rows affected.

[('Youtube',), ('Facebook',), ('Organic',), ('Google',)]

판다스와 연동하는 방법

In [27]:
result = %sql SELECT * FROM raw_data.user_session_channel
df = result.DataFrame()

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
101520 rows affected.

In [28]:
df.head()

   userid                         sessionid    channel
0    1651  0004289ee1c7b8b08c77e19878106ae3    Organic
1    1197  00053f5e11d1fe4e49a221165b39abc9   Facebook
2    1401  00056c20eb5a029583db75506953f1d9   Facebook
3    1399  00063cb5da1826febf178b669eea3250   Facebook
4    1667  000958fdaefe0dd06f5d7c4e4a5f28d1  Instagram

In [29]:
df.groupby(["channel"]).size()

channel
Facebook     16791
Google       16982
Instagram    16831
Naver        16921
Organic      16904
Youtube      17091
dtype: int64

In [30]:
df.groupby(["channel"])["sessionid"].count()

channel
Facebook     16791
Google       16982
Instagram    16831
Naver        16921
Organic      16904
Youtube      17091
Name: sessionid, dtype: int64

In [31]:
result = %sql SELECT * FROM raw_data.session_timestamp
df_st = result.DataFrame()

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
101520 rows affected.

In [32]:
df_st['date'] = df_st['ts'].apply(lambda x: "%d-%02d-%02d" % (x.year, x.month, x.day))

In [33]:
df_st.head()

                          sessionid                      ts        date
0  0002ac0d783338cfeab0b2bdbd872cda 2019-07-29 12:39:41.817  2019-07-29
1  00053f5e11d1fe4e49a221165b39abc9 2019-06-24 13:04:26.370  2019-06-24
2  00056c20eb5a029583db75506953f1d9 2019-09-26 14:50:17.000  2019-09-26
3  00063cb5da1826febf178b669eea3250 2019-10-16 14:04:42.797  2019-10-16
4  0007cda84fafdcf42f96c4f4adb7f8ce 2019-05-22 08:02:29.360  2019-05-22

In [34]:
df_st.groupby(["date"]).size()  # .sort_values(["date"])

date
2019-05-01    147
2019-05-02    161
2019-05-03    150
2019-05-04    142
2019-05-05    144
             ...
2019-11-26    633
2019-11-27    617
2019-11-28    516
2019-11-29    531
2019-11-30    562
Length: 214, dtype: int64

In [35]:
df_st.groupby(["date"])["sessionid"].count().reset_index(name='count').sort_values("date", ascending=False)

           date  count
213  2019-11-30    562
212  2019-11-29    531
211  2019-11-28    516
210  2019-11-27    617
209  2019-11-26    633
..          ...    ...
4    2019-05-05    144
3    2019-05-04    142
2    2019-05-03    150
1    2019-05-02    161
0    2019-05-01    147

[214 rows x 2 columns]

In [39]:
%%sql

SELECT TO_CHAR(st.ts, 'YYYY-MM') AS monthly, count(DISTINCT usc.userId) as users
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY monthly
ORDER BY monthly

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-05', 6261),
 ('2019-06', 10520),
 ('2019-07', 14840),
 ('2019-08', 17151),
 ('2019-09', 15790),
 ('2019-10', 18899),
 ('2019-11', 18059)]